package com.BC.entertainmentgravitation.util;

public class ConstantArrayListsUtil {

	/**
	 * 性别
	 */
	public static String[] gender = { "男", "女" };
	/**
	 * 职业
	 */
	public static String[] professional = { "影视演员", "歌唱演员", "舞蹈演员", "话剧演员", "戏曲演员", 
		"相声演员", "魔术演员", "曲艺演员", "杂技演员", "播音主持", "时装模特", "影视导演", "话剧导演", 
		"广告导演", "歌舞导演", "戏剧导演", "执行导演", "演员副导", "演员统筹", "其他（可编辑）"};

	
//	public static String[] professional = { "演员", "歌手", "模特", "编剧", "导演",
//			"投资人", "其他（可编辑）" };
	/**
	 * 国籍
	 */
	public static String[] nationality = { "中国", "美国", "英国", "法国", "德国", "韩国",
			"泰国", "日本", "瑞典", "荷兰", "丹麦", "俄罗斯", "加拿大", "澳大利亚", "其他（可编辑）" };
	// /**
	// * 地区
	// */
	// public static String[] region = { "", };
	/**
	 * 语言
	 */
	public static String[] language = { "普通话", "英语", "日语", "俄语", "地方语言（可编辑）",
			"其他（可编辑）" };
	/**
	 * 星座
	 */

	public static String[] constellation = { "白羊座", "金牛座", "双子座", "巨蟹座", "狮子座",
			"处女座", "天秤座", "天蝎座", "射手座", "摩羯座", "水瓶座", "双鱼座" };
	/**
	 * 民族
	 */

	public static String[] national = { "汉族", "壮族", "满族", "回族", "苗族", "维吾尔族",
			"土家族", "彝族", "蒙古族", "藏族", "布依族", "侗族", "瑶族", "朝鲜族", "白族", "哈尼族",
			"哈萨克族", "黎族", "傣族", "畲族", "傈僳族", "仡佬族", "东乡族", "拉祜族", "水族", "佤族",
			"纳西族", "羌族", "土族", "仫佬族", "锡伯族", "柯尔克孜族", "达斡尔族", "景颇族", "毛南族",
			"撒拉族", "布朗族", "塔吉克族", "阿昌族", "普米族", "鄂温克族", "怒族", "京族", "基诺族",
			"德昂族", "保安族", "俄罗斯族", "裕固族", "乌孜别克族", "门巴族", "鄂伦春族", "独龙族", "塔塔尔族",
			"赫哲族", "高山族" };
	/**
	 * 身高
	 */
	public static String[] height1 = { "1", "2" };
	public static String[] height2 = { "1", "2", "3", "4", "5", "6", "7", "8",
			"9", "0" };
	public static String[] height3 = { "1", "2", "3", "4", "5", "6", "7", "8",
			"9", "0" };
	/**
	 * 体重
	 */
	public static String[] weight1 = { "1", "2", "3", "4", "5", "6", "7", "8",
			"9", "0" };
	public static String[] weight2 = { "1", "2", "3", "4", "5", "6", "7", "8",
			"9", "0" };
	/**
	 * 纯数字内容，从0开始
	 */
	public static String[] constant = { "0", "1", "2", "3", "4", "5", "6", "7",
			"8", "9" };
}
